stm32duino/ISM6HG256X/src/ism6hg256x_reg.h
#define ISM6HG256X_CTRL7                          0x16U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t lpf1_g_en                    : 1;
  uint8_t not_used0                    : 5;
  uint8_t int2_drdy_xl_hg              : 1;
  uint8_t int1_drdy_xl_hg              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int1_drdy_xl_hg              : 1;
  uint8_t int2_drdy_xl_hg              : 1;
  uint8_t not_used0                    : 5;
  uint8_t lpf1_g_en                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ctrl7_t;

#define ISM6HG256X_CTRL8                          0x17U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fs_xl                        : 2;
  uint8_t not_used0                    : 3;
  uint8_t hp_lpf2_xl_bw                : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t hp_lpf2_xl_bw                : 3;
  uint8_t not_used0                    : 3;
  uint8_t fs_xl                        : 2;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ctrl8_t;

#define ISM6HG256X_CTRL9                          0x18U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t usr_off_on_out               : 1;
  uint8_t usr_off_w                    : 1;
  uint8_t not_used0                    : 1;
  uint8_t lpf2_xl_en                   : 1;
  uint8_t hp_slope_xl_en               : 1;
  uint8_t xl_fastsettl_mode            : 1;
  uint8_t hp_ref_mode_xl               : 1;
  uint8_t not_used1                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 1;
  uint8_t hp_ref_mode_xl               : 1;
  uint8_t xl_fastsettl_mode            : 1;
  uint8_t hp_slope_xl_en               : 1;
  uint8_t lpf2_xl_en                   : 1;
  uint8_t not_used0                    : 1;
  uint8_t usr_off_w                    : 1;
  uint8_t usr_off_on_out               : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ctrl9_t;

#define ISM6HG256X_CTRL10                         0x19U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t st_xl                        : 2;
  uint8_t st_g                         : 2;
  uint8_t not_used0                    : 2;
  uint8_t emb_func_debug               : 1;
  uint8_t not_used1                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 1;
  uint8_t emb_func_debug               : 1;
  uint8_t not_used0                    : 2;
  uint8_t st_g                         : 2;
  uint8_t st_xl                        : 2;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ctrl10_t;

#define ISM6HG256X_CTRL_STATUS                    0x1AU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 2;
  uint8_t fsm_wr_ctrl_status           : 1;
  uint8_t not_used1                    : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 5;
  uint8_t fsm_wr_ctrl_status           : 1;
  uint8_t not_used0                    : 2;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ctrl_status_t;

#define ISM6HG256X_FIFO_STATUS1                   0x1BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t diff_fifo                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t diff_fifo                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fifo_status1_t;

#define ISM6HG256X_FIFO_STATUS2                   0x1CU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t diff_fifo                    : 1;
  uint8_t not_used0                    : 2;
  uint8_t fifo_ovr_latched             : 1;
  uint8_t counter_bdr_ia               : 1;
  uint8_t fifo_full_ia                 : 1;
  uint8_t fifo_ovr_ia                  : 1;
  uint8_t fifo_wtm_ia                  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_wtm_ia                  : 1;
  uint8_t fifo_ovr_ia                  : 1;
  uint8_t fifo_full_ia                 : 1;
  uint8_t counter_bdr_ia               : 1;
  uint8_t fifo_ovr_latched             : 1;
  uint8_t not_used0                    : 2;
  uint8_t diff_fifo                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fifo_status2_t;

#define ISM6HG256X_ALL_INT_SRC                    0x1DU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ff_ia                        : 1;
  uint8_t wu_ia                        : 1;
  uint8_t tap_ia                       : 1;
  uint8_t hg_ia                        : 1;
  uint8_t d6d_ia                       : 1;
  uint8_t sleep_change_ia              : 1;
  uint8_t shub_ia                      : 1;
  uint8_t emb_func_ia                  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t emb_func_ia                  : 1;
  uint8_t shub_ia                      : 1;
  uint8_t sleep_change_ia              : 1;
  uint8_t d6d_ia                       : 1;
  uint8_t hg_ia                        : 1;
  uint8_t tap_ia                       : 1;
  uint8_t wu_ia                        : 1;
  uint8_t ff_ia                        : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_all_int_src_t;

#define ISM6HG256X_STATUS_REG                     0x1EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xlda                         : 1;
  uint8_t gda                          : 1;
  uint8_t tda                          : 1;
  uint8_t xlhgda                       : 1;
  uint8_t gda_eis                      : 1;
  uint8_t ois_drdy                     : 1;
  uint8_t not_used0                    : 1;
  uint8_t timestamp_endcount           : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timestamp_endcount           : 1;
  uint8_t not_used0                    : 1;
  uint8_t ois_drdy                     : 1;
  uint8_t gda_eis                      : 1;
  uint8_t xlhgda                       : 1;
  uint8_t tda                          : 1;
  uint8_t gda                          : 1;
  uint8_t xlda                         : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_status_reg_t;

#define ISM6HG256X_OUT_TEMP_L                     0x20U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t temp                         : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t temp                         : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_out_temp_l_t;

