stm32duino/ISM6HG256X/src/ism6hg256x_reg.h
#define ISM6HG256X_WAKE_UP_THS                    0x5BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t wk_ths                       : 6;
  uint8_t usr_off_on_wu                : 1;
  uint8_t single_double_tap            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t single_double_tap            : 1;
  uint8_t usr_off_on_wu                : 1;
  uint8_t wk_ths                       : 6;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_wake_up_ths_t;

#define ISM6HG256X_WAKE_UP_DUR                    0x5CU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sleep_dur                    : 4;
  uint8_t not_used0                    : 1;
  uint8_t wake_dur                     : 2;
  uint8_t ff_dur                       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ff_dur                       : 1;
  uint8_t wake_dur                     : 2;
  uint8_t not_used0                    : 1;
  uint8_t sleep_dur                    : 4;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_wake_up_dur_t;

#define ISM6HG256X_FREE_FALL                      0x5DU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ff_ths                       : 3;
  uint8_t ff_dur                       : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ff_dur                       : 5;
  uint8_t ff_ths                       : 3;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_free_fall_t;

#define ISM6HG256X_MD1_CFG                        0x5EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int1_shub                    : 1;
  uint8_t int1_emb_func                : 1;
  uint8_t int1_6d                      : 1;
  uint8_t int1_double_tap              : 1;
  uint8_t int1_ff                      : 1;
  uint8_t int1_wu                      : 1;
  uint8_t int1_single_tap              : 1;
  uint8_t int1_sleep_change            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int1_sleep_change            : 1;
  uint8_t int1_single_tap              : 1;
  uint8_t int1_wu                      : 1;
  uint8_t int1_ff                      : 1;
  uint8_t int1_double_tap              : 1;
  uint8_t int1_6d                      : 1;
  uint8_t int1_emb_func                : 1;
  uint8_t int1_shub                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_md1_cfg_t;

#define ISM6HG256X_MD2_CFG                        0x5FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int2_timestamp               : 1;
  uint8_t int2_emb_func                : 1;
  uint8_t int2_6d                      : 1;
  uint8_t int2_double_tap              : 1;
  uint8_t int2_ff                      : 1;
  uint8_t int2_wu                      : 1;
  uint8_t int2_single_tap              : 1;
  uint8_t int2_sleep_change            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_sleep_change            : 1;
  uint8_t int2_single_tap              : 1;
  uint8_t int2_wu                      : 1;
  uint8_t int2_ff                      : 1;
  uint8_t int2_double_tap              : 1;
  uint8_t int2_6d                      : 1;
  uint8_t int2_emb_func                : 1;
  uint8_t int2_timestamp               : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_md2_cfg_t;

#define ISM6HG256X_HAODR_CFG                      0x62U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t haodr_sel                    : 2;
  uint8_t not_used0                    : 6;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 6;
  uint8_t haodr_sel                    : 2;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_haodr_cfg_t;

typedef enum {
  ISM6HG256X_HAODR_SEL_00,
  ISM6HG256X_HAODR_SEL_01,
  ISM6HG256X_HAODR_SEL_02,
  ISM6HG256X_HAODR_SEL_03,
} ism6hg256x_haodr_sel_t;

#define ISM6HG256X_EMB_FUNC_CFG                   0x63U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 3;
  uint8_t emb_func_disable             : 1;
  uint8_t emb_func_irq_mask_xl_settl   : 1;
  uint8_t emb_func_irq_mask_g_settl    : 1;
  uint8_t emb_func_irq_mask_xl_hg_settl: 1;
  uint8_t hg_usr_off_on_emb_func       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t hg_usr_off_on_emb_func       : 1;
  uint8_t emb_func_irq_mask_xl_hg_settl: 1;
  uint8_t emb_func_irq_mask_g_settl    : 1;
  uint8_t emb_func_irq_mask_xl_settl   : 1;
  uint8_t emb_func_disable             : 1;
  uint8_t not_used0                    : 3;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_emb_func_cfg_t;

#define ISM6HG256X_UI_HANDSHAKE_CTRL              0x64U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ui_shared_req                : 1;
  uint8_t ui_shared_ack                : 1;
  uint8_t not_used0                    : 6;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 6;
  uint8_t ui_shared_ack                : 1;
  uint8_t ui_shared_req                : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ui_handshake_ctrl_t;

#define ISM6HG256X_UI_IF2_SHARED_0                0x65U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ui_if2_shared                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ui_if2_shared                : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ui_if2_shared_0_t;

#define ISM6HG256X_UI_IF2_SHARED_1                0x66U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ui_if2_shared                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ui_if2_shared                : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ui_if2_shared_1_t;

#define ISM6HG256X_UI_IF2_SHARED_2                0x67U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ui_if2_shared                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ui_if2_shared                : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ui_if2_shared_2_t;

#define ISM6HG256X_UI_IF2_SHARED_3                0x68U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ui_if2_shared                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ui_if2_shared                : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ui_if2_shared_3_t;

