stm32duino/ISM6HG256X/src/ism6hg256x_reg.h
#define ISM6HG256X_FIFO_DATA_OUT_Y_L              0x7BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fifo_data_out                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_data_out                : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fifo_data_out_y_l_t;

#define ISM6HG256X_FIFO_DATA_OUT_Y_H              0x7CU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fifo_data_out                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_data_out                : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fifo_data_out_y_h_t;

#define ISM6HG256X_FIFO_DATA_OUT_Z_L              0x7DU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fifo_data_out                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_data_out                : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fifo_data_out_z_l_t;

#define ISM6HG256X_FIFO_DATA_OUT_Z_H              0x7EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fifo_data_out                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_data_out                : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fifo_data_out_z_h_t;

/**
  * @}
  *
  */

/** @defgroup bitfields page if2
  * @{
  *
  */

#define ISM6HG256X_IF2_WHO_AM_I                   0x0FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t id                           : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t id                           : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_who_am_i_t;

#define ISM6HG256X_IF2_STATUS_REG_OIS             0x1EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xlda                         : 1;
  uint8_t gda                          : 1;
  uint8_t gyro_settling                : 1;
  uint8_t not_used0                    : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 5;
  uint8_t gyro_settling                : 1;
  uint8_t gda                          : 1;
  uint8_t xlda                         : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_status_reg_ois_t;

#define ISM6HG256X_IF2_OUT_TEMP_L                 0x20U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t temp                         : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t temp                         : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_out_temp_l_t;

#define ISM6HG256X_IF2_OUT_TEMP_H                 0x21U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t temp                         : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t temp                         : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_out_temp_h_t;

#define ISM6HG256X_IF2_OUTX_L_G_OIS               0x22U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2_outx_g_ois               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t if2_outx_g_ois               : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_outx_l_g_ois_t;

#define ISM6HG256X_IF2_OUTX_H_G_OIS               0x23U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2_outx_g_ois               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t if2_outx_g_ois               : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_outx_h_g_ois_t;

#define ISM6HG256X_IF2_OUTY_L_G_OIS               0x24U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2_outy_g_ois               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t if2_outy_g_ois               : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_outy_l_g_ois_t;

#define ISM6HG256X_IF2_OUTY_H_G_OIS               0x25U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2_outy_g_ois               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t if2_outy_g_ois               : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_outy_h_g_ois_t;

#define ISM6HG256X_IF2_OUTZ_L_G_OIS               0x26U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2_outz_g_ois               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t if2_outz_g_ois               : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_outz_l_g_ois_t;

#define ISM6HG256X_IF2_OUTZ_H_G_OIS               0x27U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2_outz_g_ois               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t if2_outz_g_ois               : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_outz_h_g_ois_t;

#define ISM6HG256X_IF2_OUTX_L_A_OIS               0x28U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2_outx_a_ois               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t if2_outx_a_ois               : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_outx_l_a_ois_t;

#define ISM6HG256X_IF2_OUTX_H_A_OIS               0x29U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2_outx_a_ois               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t if2_outx_a_ois               : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_outx_h_a_ois_t;

#define ISM6HG256X_IF2_OUTY_L_A_OIS               0x2AU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2_outy_a_ois               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t if2_outy_a_ois               : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_outy_l_a_ois_t;

#define ISM6HG256X_IF2_OUTY_H_A_OIS               0x2BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2_outy_a_ois               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t if2_outy_a_ois               : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_outy_h_a_ois_t;

#define ISM6HG256X_IF2_OUTZ_L_A_OIS               0x2CU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2_outz_a_ois               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t if2_outz_a_ois               : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_outz_l_a_ois_t;

#define ISM6HG256X_IF2_OUTZ_H_A_OIS               0x2DU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2_outz_a_ois               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t if2_outz_a_ois               : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_outz_h_a_ois_t;

#define ISM6HG256X_IF2_HANDSHAKE_CTRL             0x6EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2_shared_ack               : 1;
  uint8_t if2_shared_req               : 1;
  uint8_t not_used0                    : 6;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 6;
  uint8_t if2_shared_req               : 1;
  uint8_t if2_shared_ack               : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_handshake_ctrl_t;

