stm32duino/ISM6HG256X/src/ism6hg256x_reg.h
#define ISM6HG256X_IF2_INT_OIS                    0x6FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t st_xl_ois                    : 2;
  uint8_t st_g_ois                     : 2;
  uint8_t st_ois_clampdis              : 1;
  uint8_t not_used0                    : 1;
  uint8_t drdy_mask_ois                : 1;
  uint8_t int2_drdy_ois                : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_drdy_ois                : 1;
  uint8_t drdy_mask_ois                : 1;
  uint8_t not_used0                    : 1;
  uint8_t st_ois_clampdis              : 1;
  uint8_t st_g_ois                     : 2;
  uint8_t st_xl_ois                    : 2;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_int_ois_t;

#define ISM6HG256X_IF2_CTRL1_OIS                  0x70U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2_spi_read_en              : 1;
  uint8_t ois_g_en                     : 1;
  uint8_t ois_xl_en                    : 1;
  uint8_t not_used0                    : 2;
  uint8_t sim_ois                      : 1;
  uint8_t not_used1                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 2;
  uint8_t sim_ois                      : 1;
  uint8_t not_used0                    : 2;
  uint8_t ois_xl_en                    : 1;
  uint8_t ois_g_en                     : 1;
  uint8_t if2_spi_read_en              : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_ctrl1_ois_t;

#define ISM6HG256X_IF2_CTRL2_OIS                  0x71U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fs_g_ois                     : 3;
  uint8_t lpf1_g_ois_bw                : 2;
  uint8_t not_used0                    : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 3;
  uint8_t lpf1_g_ois_bw                : 2;
  uint8_t fs_g_ois                     : 3;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_ctrl2_ois_t;

#define ISM6HG256X_IF2_CTRL3_OIS                  0x72U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fs_xl_ois                    : 2;
  uint8_t not_used0                    : 1;
  uint8_t lpf_xl_ois_bw                : 3;
  uint8_t not_used1                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 2;
  uint8_t lpf_xl_ois_bw                : 3;
  uint8_t not_used0                    : 1;
  uint8_t fs_xl_ois                    : 2;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_if2_ctrl3_ois_t;

/**
  * @}
  *
  */

/** @defgroup bitfields page embedded
  * @{
  *
  */

#define ISM6HG256X_PAGE_SEL                       0x2U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 4;
  uint8_t page_sel                     : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t page_sel                     : 4;
  uint8_t not_used0                    : 4;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_page_sel_t;

#define ISM6HG256X_EMB_FUNC_EN_A                  0x4U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 1;
  uint8_t sflp_game_en                 : 1;
  uint8_t not_used2                    : 1;
  uint8_t pedo_en                      : 1;
  uint8_t tilt_en                      : 1;
  uint8_t sign_motion_en               : 1;
  uint8_t not_used1                    : 1;
  uint8_t mlc_before_fsm_en            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc_before_fsm_en            : 1;
  uint8_t not_used1                    : 1;
  uint8_t sign_motion_en               : 1;
  uint8_t tilt_en                      : 1;
  uint8_t pedo_en                      : 1;
  uint8_t not_used2                    : 1;
  uint8_t sflp_game_en                 : 1;
  uint8_t not_used0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_emb_func_en_a_t;

#define ISM6HG256X_EMB_FUNC_EN_B                  0x5U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_en                       : 1;
  uint8_t not_used0                    : 2;
  uint8_t fifo_compr_en                : 1;
  uint8_t mlc_en                       : 1;
  uint8_t not_used1                    : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 3;
  uint8_t mlc_en                       : 1;
  uint8_t fifo_compr_en                : 1;
  uint8_t not_used0                    : 2;
  uint8_t fsm_en                       : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_emb_func_en_b_t;

#define ISM6HG256X_EMB_FUNC_EXEC_STATUS           0x7U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t emb_func_endop               : 1;
  uint8_t emb_func_exec_ovr            : 1;
  uint8_t not_used0                    : 6;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 6;
  uint8_t emb_func_exec_ovr            : 1;
  uint8_t emb_func_endop               : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_emb_func_exec_status_t;

#define ISM6HG256X_PAGE_ADDRESS                   0x8U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t page_addr                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t page_addr                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_page_address_t;

#define ISM6HG256X_PAGE_VALUE                     0x9U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t page_value                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t page_value                   : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_page_value_t;

#define ISM6HG256X_EMB_FUNC_INT1                  0x0AU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 3;
  uint8_t int1_step_detector           : 1;
  uint8_t int1_tilt                    : 1;
  uint8_t int1_sig_mot                 : 1;
  uint8_t not_used1                    : 1;
  uint8_t int1_fsm_lc                  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int1_fsm_lc                  : 1;
  uint8_t not_used1                    : 1;
  uint8_t int1_sig_mot                 : 1;
  uint8_t int1_tilt                    : 1;
  uint8_t int1_step_detector           : 1;
  uint8_t not_used0                    : 3;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_emb_func_int1_t;

