stm32duino/ISM6HG256X/src/ism6hg256x_reg.h
#define ISM6HG256X_FSM_OUTS4                      0x4FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm4_n_v                     : 1;
  uint8_t fsm4_p_v                     : 1;
  uint8_t fsm4_n_z                     : 1;
  uint8_t fsm4_p_z                     : 1;
  uint8_t fsm4_n_y                     : 1;
  uint8_t fsm4_p_y                     : 1;
  uint8_t fsm4_n_x                     : 1;
  uint8_t fsm4_p_x                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm4_p_x                     : 1;
  uint8_t fsm4_n_x                     : 1;
  uint8_t fsm4_p_y                     : 1;
  uint8_t fsm4_n_y                     : 1;
  uint8_t fsm4_p_z                     : 1;
  uint8_t fsm4_n_z                     : 1;
  uint8_t fsm4_p_v                     : 1;
  uint8_t fsm4_n_v                     : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_outs4_t;

#define ISM6HG256X_FSM_OUTS5                      0x50U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm5_n_v                     : 1;
  uint8_t fsm5_p_v                     : 1;
  uint8_t fsm5_n_z                     : 1;
  uint8_t fsm5_p_z                     : 1;
  uint8_t fsm5_n_y                     : 1;
  uint8_t fsm5_p_y                     : 1;
  uint8_t fsm5_n_x                     : 1;
  uint8_t fsm5_p_x                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm5_p_x                     : 1;
  uint8_t fsm5_n_x                     : 1;
  uint8_t fsm5_p_y                     : 1;
  uint8_t fsm5_n_y                     : 1;
  uint8_t fsm5_p_z                     : 1;
  uint8_t fsm5_n_z                     : 1;
  uint8_t fsm5_p_v                     : 1;
  uint8_t fsm5_n_v                     : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_outs5_t;

#define ISM6HG256X_FSM_OUTS6                      0x51U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm6_n_v                     : 1;
  uint8_t fsm6_p_v                     : 1;
  uint8_t fsm6_n_z                     : 1;
  uint8_t fsm6_p_z                     : 1;
  uint8_t fsm6_n_y                     : 1;
  uint8_t fsm6_p_y                     : 1;
  uint8_t fsm6_n_x                     : 1;
  uint8_t fsm6_p_x                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm6_p_x                     : 1;
  uint8_t fsm6_n_x                     : 1;
  uint8_t fsm6_p_y                     : 1;
  uint8_t fsm6_n_y                     : 1;
  uint8_t fsm6_p_z                     : 1;
  uint8_t fsm6_n_z                     : 1;
  uint8_t fsm6_p_v                     : 1;
  uint8_t fsm6_n_v                     : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_outs6_t;

#define ISM6HG256X_FSM_OUTS7                      0x52U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm7_n_v                     : 1;
  uint8_t fsm7_p_v                     : 1;
  uint8_t fsm7_n_z                     : 1;
  uint8_t fsm7_p_z                     : 1;
  uint8_t fsm7_n_y                     : 1;
  uint8_t fsm7_p_y                     : 1;
  uint8_t fsm7_n_x                     : 1;
  uint8_t fsm7_p_x                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm7_p_x                     : 1;
  uint8_t fsm7_n_x                     : 1;
  uint8_t fsm7_p_y                     : 1;
  uint8_t fsm7_n_y                     : 1;
  uint8_t fsm7_p_z                     : 1;
  uint8_t fsm7_n_z                     : 1;
  uint8_t fsm7_p_v                     : 1;
  uint8_t fsm7_n_v                     : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_outs7_t;

#define ISM6HG256X_FSM_OUTS8                      0x53U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm8_n_v                     : 1;
  uint8_t fsm8_p_v                     : 1;
  uint8_t fsm8_n_z                     : 1;
  uint8_t fsm8_p_z                     : 1;
  uint8_t fsm8_n_y                     : 1;
  uint8_t fsm8_p_y                     : 1;
  uint8_t fsm8_n_x                     : 1;
  uint8_t fsm8_p_x                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm8_p_x                     : 1;
  uint8_t fsm8_n_x                     : 1;
  uint8_t fsm8_p_y                     : 1;
  uint8_t fsm8_n_y                     : 1;
  uint8_t fsm8_p_z                     : 1;
  uint8_t fsm8_n_z                     : 1;
  uint8_t fsm8_p_v                     : 1;
  uint8_t fsm8_n_v                     : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_outs8_t;

#define ISM6HG256X_SFLP_ODR                       0x5EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 3;
  uint8_t sflp_game_odr                : 3;
  uint8_t not_used1                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 2;
  uint8_t sflp_game_odr                : 3;
  uint8_t not_used0                    : 3;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sflp_odr_t;

#define ISM6HG256X_FSM_ODR                        0x5FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 3;
  uint8_t fsm_odr                      : 3;
  uint8_t not_used1                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 2;
  uint8_t fsm_odr                      : 3;
  uint8_t not_used0                    : 3;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_odr_t;

#define ISM6HG256X_MLC_ODR                        0x60U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 4;
  uint8_t mlc_odr                      : 3;
  uint8_t not_used1                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 1;
  uint8_t mlc_odr                      : 3;
  uint8_t not_used0                    : 4;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_mlc_odr_t;

#define ISM6HG256X_STEP_COUNTER_L                 0x62U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t step                         : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t step                         : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_step_counter_l_t;

#define ISM6HG256X_STEP_COUNTER_H                 0x63U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t step                         : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t step                         : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_step_counter_h_t;

#define ISM6HG256X_EMB_FUNC_SRC                   0x64U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 2;
  uint8_t stepcounter_bit_set          : 1;
  uint8_t step_overflow                : 1;
  uint8_t step_count_delta_ia          : 1;
  uint8_t step_detected                : 1;
  uint8_t not_used1                    : 1;
  uint8_t pedo_rst_step                : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t pedo_rst_step                : 1;
  uint8_t not_used1                    : 1;
  uint8_t step_detected                : 1;
  uint8_t step_count_delta_ia          : 1;
  uint8_t step_overflow                : 1;
  uint8_t stepcounter_bit_set          : 1;
  uint8_t not_used0                    : 2;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_emb_func_src_t;

#define ISM6HG256X_EMB_FUNC_INIT_A                0x66U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 1;
  uint8_t sflp_game_init               : 1;
  uint8_t not_used2                    : 1;
  uint8_t step_det_init                : 1;
  uint8_t tilt_init                    : 1;
  uint8_t sig_mot_init                 : 1;
  uint8_t not_used1                    : 1;
  uint8_t mlc_before_fsm_init          : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc_before_fsm_init          : 1;
  uint8_t not_used1                    : 1;
  uint8_t sig_mot_init                 : 1;
  uint8_t tilt_init                    : 1;
  uint8_t step_det_init                : 1;
  uint8_t not_used2                    : 1;
  uint8_t sflp_game_init               : 1;
  uint8_t not_used0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_emb_func_init_a_t;

