stm32duino/ISM6HG256X/src/ism6hg256x_reg.h
#define ISM6HG256X_EMB_FUNC_INIT_B                0x67U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_init                     : 1;
  uint8_t not_used0                    : 1;
  uint8_t pt_init                      : 1;
  uint8_t fifo_compr_init              : 1;
  uint8_t mlc_init                     : 1;
  uint8_t not_used1                    : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 3;
  uint8_t mlc_init                     : 1;
  uint8_t fifo_compr_init              : 1;
  uint8_t pt_init                      : 1;
  uint8_t not_used0                    : 1;
  uint8_t fsm_init                     : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_emb_func_init_b_t;

#define ISM6HG256X_EMB_FUNC_SENSOR_CONV_EN        0x67U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xl_hg_conv_en                : 1;
  uint8_t gyro_conv_en                 : 1;
  uint8_t temp_conv_en                 : 1;
  uint8_t ext_sensor_conv_en           : 1;
  uint8_t not_used0                    : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 4;
  uint8_t ext_sensor_conv_en           : 1;
  uint8_t temp_conv_en                 : 1;
  uint8_t gyro_conv_en                 : 1;
  uint8_t xl_hg_conv_en                : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_emb_func_sensor_conv_en_t;

#define ISM6HG256X_MLC1_SRC                       0x70U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc1_src                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc1_src                     : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_mlc1_src_t;

#define ISM6HG256X_MLC2_SRC                       0x71U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc2_src                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc2_src                     : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_mlc2_src_t;

#define ISM6HG256X_MLC3_SRC                       0x72U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc3_src                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc3_src                     : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_mlc3_src_t;

#define ISM6HG256X_MLC4_SRC                       0x73U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc4_src                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc4_src                     : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_mlc4_src_t;

#define ISM6HG256X_MLC5_SRC                       0x74U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc5_src                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc5_src                     : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_mlc5_src_t;

#define ISM6HG256X_MLC6_SRC                       0x75U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc6_src                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc6_src                     : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_mlc6_src_t;

#define ISM6HG256X_MLC7_SRC                       0x76U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc7_src                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc7_src                     : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_mlc7_src_t;

#define ISM6HG256X_MLC8_SRC                       0x77U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc8_src                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc8_src                     : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_mlc8_src_t;

/**
  * @}
  *
  */

/** @defgroup bitfields page pg0_emb_adv
  * @{
  *
  */
#define ISM6HG256X_EMB_ADV_PG_0                   0x000U

#define ISM6HG256X_FSM_EXT_SENSITIVITY_L          0xBAU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_s                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_s                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_ext_sensitivity_l_t;

#define ISM6HG256X_FSM_EXT_SENSITIVITY_H          0xBBU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_s                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_s                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_ext_sensitivity_h_t;

#define ISM6HG256X_FSM_EXT_OFFX_L                 0xC0U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_offx                 : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_offx                 : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_ext_offx_l_t;

#define ISM6HG256X_FSM_EXT_OFFX_H                 0xC1U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_offx                 : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_offx                 : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_ext_offx_h_t;

#define ISM6HG256X_FSM_EXT_OFFY_L                 0xC2U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_offy                 : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_offy                 : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_ext_offy_l_t;

#define ISM6HG256X_FSM_EXT_OFFY_H                 0xC3U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_offy                 : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_offy                 : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_ext_offy_h_t;

#define ISM6HG256X_FSM_EXT_OFFZ_L                 0xC4U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_offz                 : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_offz                 : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_ext_offz_l_t;

#define ISM6HG256X_FSM_EXT_OFFZ_H                 0xC5U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_offz                 : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_offz                 : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_ext_offz_h_t;

#define ISM6HG256X_FSM_EXT_MATRIX_XX_L            0xC6U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_ext_mat_xx               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_ext_mat_xx               : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_ext_matrix_xx_l_t;

