stm32duino/ISM6HG256X/src/ism6hg256x_reg.h
#define ISM6HG256X_FSM_START_ADD_H                0x7FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fsm_start                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fsm_start                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_fsm_start_add_h_t;

#define ISM6HG256X_PEDO_CMD_REG                   0x83U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 2;
  uint8_t fp_rejection_en              : 1;
  uint8_t carry_count_en               : 1;
  uint8_t not_used1                    : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 4;
  uint8_t carry_count_en               : 1;
  uint8_t fp_rejection_en              : 1;
  uint8_t not_used0                    : 2;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_pedo_cmd_reg_t;

#define ISM6HG256X_PEDO_DEB_STEPS_CONF            0x84U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t deb_step                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t deb_step                     : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_pedo_deb_steps_conf_t;

#define ISM6HG256X_PEDO_SC_DELTAT_L               0xD0U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t pd_sc                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t pd_sc                        : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_pedo_sc_deltat_l_t;

#define ISM6HG256X_PEDO_SC_DELTAT_H               0xD1U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t pd_sc                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t pd_sc                        : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_pedo_sc_deltat_h_t;

#define ISM6HG256X_MLC_EXT_SENSITIVITY_L          0xE8U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc_ext_s                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc_ext_s                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_mlc_ext_sensitivity_l_t;

#define ISM6HG256X_MLC_EXT_SENSITIVITY_H          0xE9U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mlc_ext_s                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mlc_ext_s                    : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_mlc_ext_sensitivity_h_t;

/** @defgroup bitfields page pg2_emb_adv
  * @{
  *
  */
#define ISM6HG256X_EMB_ADV_PG_2                   0x200U

#define ISM6HG256X_EXT_FORMAT                     0x00
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 1;
  uint8_t ext_format_sel               : 1;
  uint8_t not_used1                    : 6;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 6;
  uint8_t ext_format_sel               : 1;
  uint8_t not_used0                    : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ext_format_t;

#define ISM6HG256X_EXT_3BYTE_SENSITIVITY_L        0x02U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ext_3byte_s                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ext_3byte_s                  : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ext_3byte_sensitivity_l_t;

#define ISM6HG256X_EXT_3BYTE_SENSITIVITY_H        0x03U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ext_3byte_s                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ext_3byte_s                  : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ext_3byte_sensitivity_h_t;

#define ISM6HG256X_EXT_3BYTE_OFFSET_XL            0x06U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ext_3byte_off                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ext_3byte_off                : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ext_3byte_offset_xl_t;

#define ISM6HG256X_EXT_3BYTE_OFFSET_L             0x07U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ext_3byte_off                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ext_3byte_off                : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ext_3byte_offset_l_t;

#define ISM6HG256X_EXT_3BYTE_OFFSET_H             0x08U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ext_3byte_off                : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ext_3byte_off                : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_ext_3byte_offset_h_t;

/**
  * @}
  *
  */

/** @defgroup bitfields page sensor_hub
  * @{
  *
  */

#define ISM6HG256X_SENSOR_HUB_1                   0x2U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub1                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub1                   : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_1_t;

#define ISM6HG256X_SENSOR_HUB_2                   0x3U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub2                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub2                   : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_2_t;

#define ISM6HG256X_SENSOR_HUB_3                   0x4U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub3                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub3                   : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_3_t;

#define ISM6HG256X_SENSOR_HUB_4                   0x5U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub4                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub4                   : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_4_t;

#define ISM6HG256X_SENSOR_HUB_5                   0x6U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub5                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub5                   : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_5_t;

#define ISM6HG256X_SENSOR_HUB_6                   0x7U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub6                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub6                   : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_6_t;

#define ISM6HG256X_SENSOR_HUB_7                   0x8U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub7                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub7                   : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_7_t;

#define ISM6HG256X_SENSOR_HUB_8                   0x9U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub8                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub8                   : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_8_t;

