stm32duino/ISM6HG256X/src/ism6hg256x_reg.h
#define ISM6HG256X_SENSOR_HUB_9                   0x0AU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub9                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub9                   : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_9_t;

#define ISM6HG256X_SENSOR_HUB_10                  0x0BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub10                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub10                  : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_10_t;

#define ISM6HG256X_SENSOR_HUB_11                  0x0CU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub11                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub11                  : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_11_t;

#define ISM6HG256X_SENSOR_HUB_12                  0x0DU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub12                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub12                  : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_12_t;

#define ISM6HG256X_SENSOR_HUB_13                  0x0EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub13                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub13                  : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_13_t;

#define ISM6HG256X_SENSOR_HUB_14                  0x0FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub14                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub14                  : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_14_t;

#define ISM6HG256X_SENSOR_HUB_15                  0x10U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub15                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub15                  : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_15_t;

#define ISM6HG256X_SENSOR_HUB_16                  0x11U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub16                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub16                  : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_16_t;

#define ISM6HG256X_SENSOR_HUB_17                  0x12U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub17                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub17                  : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_17_t;

#define ISM6HG256X_SENSOR_HUB_18                  0x13U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub18                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub18                  : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_sensor_hub_18_t;

#define ISM6HG256X_CONTROLLER_CONFIG              0x14U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t aux_sens_on                  : 2;
  uint8_t controller_on                : 1;
  uint8_t not_used0                    : 1;
  uint8_t pass_through_mode            : 1;
  uint8_t start_config                 : 1;
  uint8_t write_once                   : 1;
  uint8_t rst_controller_regs          : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t rst_controller_regs          : 1;
  uint8_t write_once                   : 1;
  uint8_t start_config                 : 1;
  uint8_t pass_through_mode            : 1;
  uint8_t not_used0                    : 1;
  uint8_t controller_on                : 1;
  uint8_t aux_sens_on                  : 2;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_controller_config_t;

#define ISM6HG256X_TGT0_ADD                       0x15U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t rw_0                         : 1;
  uint8_t target0_add                  : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t target0_add                  : 7;
  uint8_t rw_0                         : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_tgt0_add_t;

#define ISM6HG256X_TGT0_SUBADD                    0x16U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t target0_reg                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t target0_reg                  : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_tgt0_subadd_t;

#define ISM6HG256X_TGT0_CONFIG                    0x17U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t target0_numop                : 3;
  uint8_t batch_ext_sens_0_en          : 1;
  uint8_t not_used0                    : 1;
  uint8_t shub_odr                     : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t shub_odr                     : 3;
  uint8_t not_used0                    : 1;
  uint8_t batch_ext_sens_0_en          : 1;
  uint8_t target0_numop                : 3;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_tgt0_config_t;

#define ISM6HG256X_TGT1_ADD                       0x18U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t r_1                          : 1;
  uint8_t target1_add                  : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t target1_add                  : 7;
  uint8_t r_1                          : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_tgt1_add_t;

#define ISM6HG256X_TGT1_SUBADD                    0x19U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t target1_reg                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t target1_reg                  : 8;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_tgt1_subadd_t;

#define ISM6HG256X_TGT1_CONFIG                    0x1AU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t target1_numop                : 3;
  uint8_t batch_ext_sens_1_en          : 1;
  uint8_t not_used0                    : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 4;
  uint8_t batch_ext_sens_1_en          : 1;
  uint8_t target1_numop                : 3;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_tgt1_config_t;

#define ISM6HG256X_TGT2_ADD                       0x1BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t r_2                          : 1;
  uint8_t target2_add                  : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t target2_add                  : 7;
  uint8_t r_2                          : 1;
#endif /* DRV_BYTE_ORDER */
} ism6hg256x_tgt2_add_t;

