stm32duino/ISM6HG256X/src/ism6hg256x_reg.h
int32_t ism6hg256x_hg_xl_data_rate_set(const ism6hg256x_ctx_t *ctx,
                                       ism6hg256x_hg_xl_data_rate_t val,
                                       uint8_t reg_out_en);
int32_t ism6hg256x_hg_xl_data_rate_get(const ism6hg256x_ctx_t *ctx,
                                       ism6hg256x_hg_xl_data_rate_t *val,
                                       uint8_t *reg_out_en);
ism6hg256x_hg_xl_data_rate_t ism6hg256x_hg_float_to_data_rate(uint8_t haodr_sel,
                                                              float_t val);
int32_t ism6hg256x_hg_data_rate_to_float(ism6hg256x_hg_xl_data_rate_t val,
                                         float_t *odr);

typedef enum {
  ISM6HG256X_XL_HIGH_PERFORMANCE_MD   = 0x0,
  ISM6HG256X_XL_HIGH_ACCURACY_ODR_MD  = 0x1,
  ISM6HG256X_XL_ODR_TRIGGERED_MD      = 0x3,
  ISM6HG256X_XL_LOW_POWER_2_AVG_MD    = 0x4,
  ISM6HG256X_XL_LOW_POWER_4_AVG_MD    = 0x5,
  ISM6HG256X_XL_LOW_POWER_8_AVG_MD    = 0x6,
  ISM6HG256X_XL_NORMAL_MD             = 0x7,
} ism6hg256x_xl_mode_t;
int32_t ism6hg256x_xl_mode_set(const ism6hg256x_ctx_t *ctx, ism6hg256x_xl_mode_t val);
int32_t ism6hg256x_xl_mode_get(const ism6hg256x_ctx_t *ctx, ism6hg256x_xl_mode_t *val);

typedef enum {
  ISM6HG256X_GY_HIGH_PERFORMANCE_MD   = 0x0,
  ISM6HG256X_GY_HIGH_ACCURACY_ODR_MD  = 0x1,
  ISM6HG256X_GY_ODR_TRIGGERED_MD      = 0x3,
  ISM6HG256X_GY_SLEEP_MD              = 0x4,
  ISM6HG256X_GY_LOW_POWER_MD          = 0x5,
} ism6hg256x_gy_mode_t;
int32_t ism6hg256x_gy_mode_set(const ism6hg256x_ctx_t *ctx, ism6hg256x_gy_mode_t val);
int32_t ism6hg256x_gy_mode_get(const ism6hg256x_ctx_t *ctx, ism6hg256x_gy_mode_t *val);

int32_t ism6hg256x_auto_increment_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_auto_increment_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

int32_t ism6hg256x_block_data_update_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_block_data_update_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

int32_t ism6hg256x_odr_trig_cfg_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_odr_trig_cfg_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM6HG256X_DRDY_LATCHED = 0x0,
  ISM6HG256X_DRDY_PULSED  = 0x1,
} ism6hg256x_data_ready_mode_t;
int32_t ism6hg256x_data_ready_mode_set(const ism6hg256x_ctx_t *ctx,
                                       ism6hg256x_data_ready_mode_t val);
int32_t ism6hg256x_data_ready_mode_get(const ism6hg256x_ctx_t *ctx,
                                       ism6hg256x_data_ready_mode_t *val);

typedef struct {
  uint8_t hg_event                     : 1;
  uint8_t hg_wakeup_z                  : 1;
  uint8_t hg_wakeup_y                  : 1;
  uint8_t hg_wakeup_x                  : 1;
  uint8_t hg_wakeup                    : 1;
  uint8_t hg_wakeup_chg                : 1;
  uint8_t hg_shock                     : 1;
  uint8_t hg_shock_change              : 1;
} ism6hg256x_hg_event_t;
int32_t ism6hg256x_hg_event_get(const ism6hg256x_ctx_t *ctx, ism6hg256x_hg_event_t *val);

typedef struct {
  uint8_t hg_wakeup_ths                  : 8;
  uint8_t hg_shock_dur                   : 4;
} ism6hg256x_hg_wake_up_cfg_t;
int32_t ism6hg256x_hg_wake_up_cfg_set(const ism6hg256x_ctx_t *ctx,
                                      ism6hg256x_hg_wake_up_cfg_t val);
int32_t ism6hg256x_hg_wake_up_cfg_get(const ism6hg256x_ctx_t *ctx,
                                      ism6hg256x_hg_wake_up_cfg_t *val);

typedef struct {
  uint8_t hg_interrupts_enable         : 1;
  uint8_t hg_wakeup_int_sel            : 1;
} ism6hg256x_hg_wu_interrupt_cfg_t;
int32_t ism6hg256x_hg_wu_interrupt_cfg_set(const ism6hg256x_ctx_t *ctx,
                                           ism6hg256x_hg_wu_interrupt_cfg_t val);
int32_t ism6hg256x_hg_wu_interrupt_cfg_get(const ism6hg256x_ctx_t *ctx,
                                           ism6hg256x_hg_wu_interrupt_cfg_t *val);

int32_t ism6hg256x_hg_emb_usr_off_correction_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_hg_emb_usr_off_correction_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

int32_t ism6hg256x_hg_wu_usr_off_correction_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_hg_wu_usr_off_correction_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

typedef struct {
  uint8_t enable                       : 1; /* interrupt enable */
  uint8_t lir                          : 1; /* interrupt pulsed or latched */
} ism6hg256x_interrupt_mode_t;
int32_t ism6hg256x_interrupt_enable_set(const ism6hg256x_ctx_t *ctx,
                                        ism6hg256x_interrupt_mode_t val);
int32_t ism6hg256x_interrupt_enable_get(const ism6hg256x_ctx_t *ctx,
                                        ism6hg256x_interrupt_mode_t *val);

typedef enum {
  ISM6HG256X_250dps  = 0x1,
  ISM6HG256X_500dps  = 0x2,
  ISM6HG256X_1000dps = 0x3,
  ISM6HG256X_2000dps = 0x4,
  ISM6HG256X_4000dps = 0x5,
} ism6hg256x_gy_full_scale_t;
int32_t ism6hg256x_gy_full_scale_set(const ism6hg256x_ctx_t *ctx,
                                     ism6hg256x_gy_full_scale_t val);
int32_t ism6hg256x_gy_full_scale_get(const ism6hg256x_ctx_t *ctx,
                                     ism6hg256x_gy_full_scale_t *val);

typedef enum {
  ISM6HG256X_2g  = 0x0,
  ISM6HG256X_4g  = 0x1,
  ISM6HG256X_8g  = 0x2,
  ISM6HG256X_16g = 0x3,
} ism6hg256x_xl_full_scale_t;
int32_t ism6hg256x_xl_full_scale_set(const ism6hg256x_ctx_t *ctx,
                                     ism6hg256x_xl_full_scale_t val);
int32_t ism6hg256x_xl_full_scale_get(const ism6hg256x_ctx_t *ctx,
                                     ism6hg256x_xl_full_scale_t *val);

typedef enum {
  ISM6HG256X_32g  = 0x0,
  ISM6HG256X_64g  = 0x1,
  ISM6HG256X_128g  = 0x2,
  ISM6HG256X_256g = 0x3,
} ism6hg256x_hg_xl_full_scale_t;
int32_t ism6hg256x_hg_xl_full_scale_set(const ism6hg256x_ctx_t *ctx,
                                        ism6hg256x_hg_xl_full_scale_t val);
int32_t ism6hg256x_hg_xl_full_scale_get(const ism6hg256x_ctx_t *ctx,
                                        ism6hg256x_hg_xl_full_scale_t *val);

