stm32duino/ISM6HG256X/src/ism6hg256x_reg.h
typedef enum {
  ISM6HG256X_ST_DISABLE  = 0x0,
  ISM6HG256X_ST_POSITIVE = 0x1,
  ISM6HG256X_ST_NEGATIVE = 0x2,
} ism6hg256x_self_test_t;
int32_t ism6hg256x_xl_self_test_set(const ism6hg256x_ctx_t *ctx, ism6hg256x_self_test_t val);
int32_t ism6hg256x_xl_self_test_get(const ism6hg256x_ctx_t *ctx, ism6hg256x_self_test_t *val);

int32_t ism6hg256x_ois_xl_self_test_set(const ism6hg256x_ctx_t *ctx, ism6hg256x_self_test_t val);
int32_t ism6hg256x_ois_xl_self_test_get(const ism6hg256x_ctx_t *ctx, ism6hg256x_self_test_t *val);

int32_t ism6hg256x_gy_self_test_set(const ism6hg256x_ctx_t *ctx, ism6hg256x_self_test_t val);
int32_t ism6hg256x_gy_self_test_get(const ism6hg256x_ctx_t *ctx, ism6hg256x_self_test_t *val);

int32_t ism6hg256x_hg_xl_self_test_set(const ism6hg256x_ctx_t *ctx, ism6hg256x_self_test_t val);
int32_t ism6hg256x_hg_xl_self_test_get(const ism6hg256x_ctx_t *ctx, ism6hg256x_self_test_t *val);

typedef enum {
  ISM6HG256X_OIS_GY_ST_DISABLE   = 0x0,
  ISM6HG256X_OIS_GY_ST_POSITIVE  = 0x1,
  ISM6HG256X_OIS_GY_ST_NEGATIVE  = 0x2,
  ISM6HG256X_OIS_GY_ST_CLAMP_POS = 0x5,
  ISM6HG256X_OIS_GY_ST_CLAMP_NEG = 0x6,

} ism6hg256x_ois_gy_self_test_t;
int32_t ism6hg256x_ois_gy_self_test_set(const ism6hg256x_ctx_t *ctx,
                                        ism6hg256x_ois_gy_self_test_t val);
int32_t ism6hg256x_ois_gy_self_test_get(const ism6hg256x_ctx_t *ctx,
                                        ism6hg256x_ois_gy_self_test_t *val);

typedef struct {
  uint8_t drdy_xl                      : 1;
  uint8_t drdy_gy                      : 1;
  uint8_t drdy_temp                    : 1;
  uint8_t drdy_xlhgda                  : 1;
  uint8_t drdy_eis                     : 1;
  uint8_t drdy_ois                     : 1;
  uint8_t gy_settling                  : 1;
  uint8_t timestamp                    : 1;
  uint8_t hg                           : 1;
  uint8_t free_fall                    : 1;
  uint8_t wake_up                      : 1;
  uint8_t wake_up_z                    : 1;
  uint8_t wake_up_y                    : 1;
  uint8_t wake_up_x                    : 1;
  uint8_t single_tap                   : 1;
  uint8_t double_tap                   : 1;
  uint8_t tap_z                        : 1;
  uint8_t tap_y                        : 1;
  uint8_t tap_x                        : 1;
  uint8_t tap_sign                     : 1;
  uint8_t six_d                        : 1;
  uint8_t six_d_xl                     : 1;
  uint8_t six_d_xh                     : 1;
  uint8_t six_d_yl                     : 1;
  uint8_t six_d_yh                     : 1;
  uint8_t six_d_zl                     : 1;
  uint8_t six_d_zh                     : 1;
  uint8_t sleep_change                 : 1;
  uint8_t sleep_state                  : 1;
  uint8_t step_detector                : 1;
  uint8_t step_count_inc               : 1;
  uint8_t step_count_overflow          : 1;
  uint8_t step_on_delta_time           : 1;
  uint8_t emb_func_stand_by            : 1;
  uint8_t emb_func_time_exceed         : 1;
  uint8_t tilt                         : 1;
  uint8_t sig_mot                      : 1;
  uint8_t fsm_lc                       : 1;
  uint8_t fsm1                         : 1;
  uint8_t fsm2                         : 1;
  uint8_t fsm3                         : 1;
  uint8_t fsm4                         : 1;
  uint8_t fsm5                         : 1;
  uint8_t fsm6                         : 1;
  uint8_t fsm7                         : 1;
  uint8_t fsm8                         : 1;
  uint8_t mlc1                         : 1;
  uint8_t mlc2                         : 1;
  uint8_t mlc3                         : 1;
  uint8_t mlc4                         : 1;
  uint8_t mlc5                         : 1;
  uint8_t mlc6                         : 1;
  uint8_t mlc7                         : 1;
  uint8_t mlc8                         : 1;
  uint8_t sh_endop                     : 1;
  uint8_t sh_target0_nack              : 1;
  uint8_t sh_target1_nack              : 1;
  uint8_t sh_target2_nack              : 1;
  uint8_t sh_target3_nack              : 1;
  uint8_t sh_wr_once                   : 1;
  uint8_t fifo_bdr                     : 1;
  uint8_t fifo_full                    : 1;
  uint8_t fifo_ovr                     : 1;
  uint8_t fifo_th                      : 1;
} ism6hg256x_all_sources_t;
int32_t ism6hg256x_all_sources_get(const ism6hg256x_ctx_t *ctx,
                                   ism6hg256x_all_sources_t *val);

typedef struct {
  uint8_t drdy_xl                      : 1;
  uint8_t drdy_g                       : 1;
  uint8_t drdy_g_eis                   : 1;
  uint8_t drdy_temp                    : 1;
  uint8_t fifo_th                      : 1;
  uint8_t fifo_ovr                     : 1;
  uint8_t fifo_full                    : 1;
  uint8_t cnt_bdr                      : 1;
  uint8_t timestamp                    : 1;
  uint8_t shub                         : 1;
  uint8_t sixd                         : 1;
  uint8_t single_tap                   : 1;
  uint8_t double_tap                   : 1;
  uint8_t wakeup                       : 1;
  uint8_t freefall                     : 1;
  uint8_t sleep_change                 : 1;
  uint8_t drdy_hg_xl                   : 1; /* High-g */
  uint8_t hg_wakeup                    : 1;
  uint8_t hg_shock_change              : 1;
  uint8_t step_detector                : 1; /* Embedded Functions */
  uint8_t tilt                         : 1;
  uint8_t sig_mot                      : 1;
  uint8_t emb_func_endop               : 1;
  uint8_t fsm1                         : 1; /* FSM */
  uint8_t fsm2                         : 1;
  uint8_t fsm3                         : 1;
  uint8_t fsm4                         : 1;
  uint8_t fsm5                         : 1;
  uint8_t fsm6                         : 1;
  uint8_t fsm7                         : 1;
  uint8_t fsm8                         : 1;
  uint8_t mlc1                         : 1; /* MLC */
  uint8_t mlc2                         : 1;
  uint8_t mlc3                         : 1;
  uint8_t mlc4                         : 1;
  uint8_t mlc5                         : 1;
  uint8_t mlc6                         : 1;
  uint8_t mlc7                         : 1;
  uint8_t mlc8                         : 1;
} ism6hg256x_pin_int_route_t;

