stm32duino/ISM6HG256X/src/ism6hg256x_reg.h
typedef enum {
  ISM6HG256X_XL_NOT_BATCHED       = 0x0,
  ISM6HG256X_XL_BATCHED_AT_1Hz875 = 0x1,
  ISM6HG256X_XL_BATCHED_AT_7Hz5   = 0x2,
  ISM6HG256X_XL_BATCHED_AT_15Hz   = 0x3,
  ISM6HG256X_XL_BATCHED_AT_30Hz   = 0x4,
  ISM6HG256X_XL_BATCHED_AT_60Hz   = 0x5,
  ISM6HG256X_XL_BATCHED_AT_120Hz  = 0x6,
  ISM6HG256X_XL_BATCHED_AT_240Hz  = 0x7,
  ISM6HG256X_XL_BATCHED_AT_480Hz  = 0x8,
  ISM6HG256X_XL_BATCHED_AT_960Hz  = 0x9,
  ISM6HG256X_XL_BATCHED_AT_1920Hz = 0xa,
  ISM6HG256X_XL_BATCHED_AT_3840Hz = 0xb,
  ISM6HG256X_XL_BATCHED_AT_7680Hz = 0xc,
} ism6hg256x_fifo_xl_batch_t;
int32_t ism6hg256x_fifo_xl_batch_set(const ism6hg256x_ctx_t *ctx,
                                     ism6hg256x_fifo_xl_batch_t val);
int32_t ism6hg256x_fifo_xl_batch_get(const ism6hg256x_ctx_t *ctx,
                                     ism6hg256x_fifo_xl_batch_t *val);

typedef enum {
  ISM6HG256X_GY_NOT_BATCHED       = 0x0,
  ISM6HG256X_GY_BATCHED_AT_1Hz875 = 0x1,
  ISM6HG256X_GY_BATCHED_AT_7Hz5   = 0x2,
  ISM6HG256X_GY_BATCHED_AT_15Hz   = 0x3,
  ISM6HG256X_GY_BATCHED_AT_30Hz   = 0x4,
  ISM6HG256X_GY_BATCHED_AT_60Hz   = 0x5,
  ISM6HG256X_GY_BATCHED_AT_120Hz  = 0x6,
  ISM6HG256X_GY_BATCHED_AT_240Hz  = 0x7,
  ISM6HG256X_GY_BATCHED_AT_480Hz  = 0x8,
  ISM6HG256X_GY_BATCHED_AT_960Hz  = 0x9,
  ISM6HG256X_GY_BATCHED_AT_1920Hz = 0xa,
  ISM6HG256X_GY_BATCHED_AT_3840Hz = 0xb,
  ISM6HG256X_GY_BATCHED_AT_7680Hz = 0xc,
} ism6hg256x_fifo_gy_batch_t;
int32_t ism6hg256x_fifo_gy_batch_set(const ism6hg256x_ctx_t *ctx,
                                     ism6hg256x_fifo_gy_batch_t val);
int32_t ism6hg256x_fifo_gy_batch_get(const ism6hg256x_ctx_t *ctx,
                                     ism6hg256x_fifo_gy_batch_t *val);

int32_t ism6hg256x_fifo_hg_xl_batch_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_fifo_hg_xl_batch_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM6HG256X_BYPASS_MODE             = 0x0,
  ISM6HG256X_FIFO_MODE               = 0x1,
  ISM6HG256X_STREAM_WTM_TO_FULL_MODE = 0x2,
  ISM6HG256X_STREAM_TO_FIFO_MODE     = 0x3,
  ISM6HG256X_BYPASS_TO_STREAM_MODE   = 0x4,
  ISM6HG256X_STREAM_MODE             = 0x6,
  ISM6HG256X_BYPASS_TO_FIFO_MODE     = 0x7,
} ism6hg256x_fifo_mode_t;
int32_t ism6hg256x_fifo_mode_set(const ism6hg256x_ctx_t *ctx, ism6hg256x_fifo_mode_t val);
int32_t ism6hg256x_fifo_mode_get(const ism6hg256x_ctx_t *ctx,
                                 ism6hg256x_fifo_mode_t *val);

int32_t ism6hg256x_fifo_gy_eis_batch_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_fifo_gy_eis_batch_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM6HG256X_TEMP_NOT_BATCHED       = 0x0,
  ISM6HG256X_TEMP_BATCHED_AT_1Hz875 = 0x1,
  ISM6HG256X_TEMP_BATCHED_AT_15Hz   = 0x2,
  ISM6HG256X_TEMP_BATCHED_AT_60Hz   = 0x3,
} ism6hg256x_fifo_temp_batch_t;
int32_t ism6hg256x_fifo_temp_batch_set(const ism6hg256x_ctx_t *ctx,
                                       ism6hg256x_fifo_temp_batch_t val);
int32_t ism6hg256x_fifo_temp_batch_get(const ism6hg256x_ctx_t *ctx,
                                       ism6hg256x_fifo_temp_batch_t *val);

typedef enum {
  ISM6HG256X_TMSTMP_NOT_BATCHED = 0x0,
  ISM6HG256X_TMSTMP_DEC_1       = 0x1,
  ISM6HG256X_TMSTMP_DEC_8       = 0x2,
  ISM6HG256X_TMSTMP_DEC_32      = 0x3,
} ism6hg256x_fifo_timestamp_batch_t;
int32_t ism6hg256x_fifo_timestamp_batch_set(const ism6hg256x_ctx_t *ctx,
                                            ism6hg256x_fifo_timestamp_batch_t val);
int32_t ism6hg256x_fifo_timestamp_batch_get(const ism6hg256x_ctx_t *ctx,
                                            ism6hg256x_fifo_timestamp_batch_t *val);

int32_t ism6hg256x_fifo_batch_counter_threshold_set(const ism6hg256x_ctx_t *ctx,
                                                    uint16_t val);
int32_t ism6hg256x_fifo_batch_counter_threshold_get(const ism6hg256x_ctx_t *ctx,
                                                    uint16_t *val);

typedef enum {
  ISM6HG256X_XL_LG_BATCH_EVENT  = 0x0,
  ISM6HG256X_GY_BATCH_EVENT     = 0x1,
  ISM6HG256X_GY_EIS_BATCH_EVENT = 0x2,
  ISM6HG256X_XL_HG_BATCH_EVENT  = 0x3,
} ism6hg256x_fifo_batch_cnt_event_t;
int32_t ism6hg256x_fifo_batch_cnt_event_set(const ism6hg256x_ctx_t *ctx,
                                            ism6hg256x_fifo_batch_cnt_event_t val);
int32_t ism6hg256x_fifo_batch_cnt_event_get(const ism6hg256x_ctx_t *ctx,
                                            ism6hg256x_fifo_batch_cnt_event_t *val);

typedef struct {
  uint16_t fifo_level                  : 9;
  uint8_t fifo_bdr                     : 1;
  uint8_t fifo_full                    : 1;
  uint8_t fifo_ovr                     : 1;
  uint8_t fifo_th                      : 1;
} ism6hg256x_fifo_status_t;

int32_t ism6hg256x_fifo_status_get(const ism6hg256x_ctx_t *ctx,
                                   ism6hg256x_fifo_status_t *val);

typedef struct {
  enum {
    ISM6HG256X_FIFO_EMPTY                    = 0x0,
    ISM6HG256X_GY_NC_TAG                     = 0x1,
    ISM6HG256X_XL_NC_TAG                     = 0x2,
    ISM6HG256X_TEMPERATURE_TAG               = 0x3,
    ISM6HG256X_TIMESTAMP_TAG                 = 0x4,
    ISM6HG256X_CFG_CHANGE_TAG                = 0x5,
    ISM6HG256X_XL_NC_T_2_TAG                 = 0x6,
    ISM6HG256X_XL_NC_T_1_TAG                 = 0x7,
    ISM6HG256X_XL_2XC_TAG                    = 0x8,
    ISM6HG256X_XL_3XC_TAG                    = 0x9,
    ISM6HG256X_GY_NC_T_2_TAG                 = 0xA,
    ISM6HG256X_GY_NC_T_1_TAG                 = 0xB,
    ISM6HG256X_GY_2XC_TAG                    = 0xC,
    ISM6HG256X_GY_3XC_TAG                    = 0xD,
    ISM6HG256X_SENSORHUB_TARGET0_TAG         = 0xE,
    ISM6HG256X_SENSORHUB_TARGET1_TAG         = 0xF,
    ISM6HG256X_SENSORHUB_TARGET2_TAG         = 0x10,
    ISM6HG256X_SENSORHUB_TARGET3_TAG         = 0x11,
    ISM6HG256X_STEP_COUNTER_TAG              = 0x12,
    ISM6HG256X_SFLP_GAME_ROTATION_VECTOR_TAG = 0x13,
    ISM6HG256X_SFLP_GYROSCOPE_BIAS_TAG       = 0x16,
    ISM6HG256X_SFLP_GRAVITY_VECTOR_TAG       = 0x17,
    ISM6HG256X_HG_XL_PEAK_TAG                = 0x18,
    ISM6HG256X_SENSORHUB_NACK_TAG            = 0x19,
    ISM6HG256X_MLC_RESULT_TAG                = 0x1A,
    ISM6HG256X_MLC_FILTER                    = 0x1B,
    ISM6HG256X_MLC_FEATURE                   = 0x1C,
    ISM6HG256X_XL_HG_TAG                     = 0x1D,
    ISM6HG256X_GY_ENHANCED_EIS               = 0x1E,
    ISM6HG256X_FSM_RESULT_TAG                = 0x1F,
  } tag;
  uint8_t cnt;
  uint8_t data[6];
} ism6hg256x_fifo_out_raw_t;
int32_t ism6hg256x_fifo_out_raw_get(const ism6hg256x_ctx_t *ctx,
                                    ism6hg256x_fifo_out_raw_t *val);

int32_t ism6hg256x_fifo_stpcnt_batch_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_fifo_stpcnt_batch_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

int32_t ism6hg256x_fifo_fsm_batch_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_fifo_fsm_batch_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

int32_t ism6hg256x_fifo_mlc_batch_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_fifo_mlc_batch_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

