stm32duino/ISM6HG256X/src/ism6hg256x_reg.h
int32_t ism6hg256x_fifo_mlc_filt_batch_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_fifo_mlc_filt_batch_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

int32_t ism6hg256x_fifo_sh_batch_target_set(const ism6hg256x_ctx_t *ctx, uint8_t idx, uint8_t val);
int32_t ism6hg256x_fifo_sh_batch_target_get(const ism6hg256x_ctx_t *ctx, uint8_t idx, uint8_t *val);

typedef struct {
  uint8_t game_rotation                : 1;
  uint8_t gravity                      : 1;
  uint8_t gbias                        : 1;
} ism6hg256x_fifo_sflp_raw_t;
int32_t ism6hg256x_fifo_sflp_batch_set(const ism6hg256x_ctx_t *ctx,
                                       ism6hg256x_fifo_sflp_raw_t val);
int32_t ism6hg256x_fifo_sflp_batch_get(const ism6hg256x_ctx_t *ctx,
                                       ism6hg256x_fifo_sflp_raw_t *val);

typedef enum {
  ISM6HG256X_AUTO          = 0x0,
  ISM6HG256X_ALWAYS_ACTIVE = 0x1,
} ism6hg256x_filt_anti_spike_t;
int32_t ism6hg256x_filt_anti_spike_set(const ism6hg256x_ctx_t *ctx,
                                       ism6hg256x_filt_anti_spike_t val);
int32_t ism6hg256x_filt_anti_spike_get(const ism6hg256x_ctx_t *ctx,
                                       ism6hg256x_filt_anti_spike_t *val);

typedef struct {
  uint8_t drdy                         : 1;
  uint8_t ois_drdy                     : 1;
  uint8_t irq_xl                       : 1;
  uint8_t irq_xl_hg                    : 1;
  uint8_t irq_g                        : 1;
} ism6hg256x_filt_settling_mask_t;
int32_t ism6hg256x_filt_settling_mask_set(const ism6hg256x_ctx_t *ctx,
                                          ism6hg256x_filt_settling_mask_t val);
int32_t ism6hg256x_filt_settling_mask_get(const ism6hg256x_ctx_t *ctx,
                                          ism6hg256x_filt_settling_mask_t *val);

typedef struct {
  uint8_t ois_drdy                     : 1;
} ism6hg256x_filt_ois_settling_mask_t;
int32_t ism6hg256x_filt_ois_settling_mask_set(const ism6hg256x_ctx_t *ctx,
                                              ism6hg256x_filt_ois_settling_mask_t val);
int32_t ism6hg256x_filt_ois_settling_mask_get(const ism6hg256x_ctx_t *ctx,
                                              ism6hg256x_filt_ois_settling_mask_t *val);

typedef enum {
  ISM6HG256X_GY_ULTRA_LIGHT   = 0x0,
  ISM6HG256X_GY_VERY_LIGHT    = 0x1,
  ISM6HG256X_GY_LIGHT         = 0x2,
  ISM6HG256X_GY_MEDIUM        = 0x3,
  ISM6HG256X_GY_STRONG        = 0x4,
  ISM6HG256X_GY_VERY_STRONG   = 0x5,
  ISM6HG256X_GY_AGGRESSIVE    = 0x6,
  ISM6HG256X_GY_XTREME        = 0x7,
} ism6hg256x_filt_gy_lp1_bandwidth_t;
int32_t ism6hg256x_filt_gy_lp1_bandwidth_set(const ism6hg256x_ctx_t *ctx,
                                             ism6hg256x_filt_gy_lp1_bandwidth_t val);
int32_t ism6hg256x_filt_gy_lp1_bandwidth_get(const ism6hg256x_ctx_t *ctx,
                                             ism6hg256x_filt_gy_lp1_bandwidth_t *val);

int32_t ism6hg256x_filt_gy_lp1_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_filt_gy_lp1_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM6HG256X_XL_ULTRA_LIGHT = 0x0,
  ISM6HG256X_XL_VERY_LIGHT  = 0x1,
  ISM6HG256X_XL_LIGHT       = 0x2,
  ISM6HG256X_XL_MEDIUM      = 0x3,
  ISM6HG256X_XL_STRONG      = 0x4,
  ISM6HG256X_XL_VERY_STRONG = 0x5,
  ISM6HG256X_XL_AGGRESSIVE  = 0x6,
  ISM6HG256X_XL_XTREME      = 0x7,
} ism6hg256x_filt_xl_lp2_bandwidth_t;
int32_t ism6hg256x_filt_xl_lp2_bandwidth_set(const ism6hg256x_ctx_t *ctx,
                                             ism6hg256x_filt_xl_lp2_bandwidth_t val);
int32_t ism6hg256x_filt_xl_lp2_bandwidth_get(const ism6hg256x_ctx_t *ctx,
                                             ism6hg256x_filt_xl_lp2_bandwidth_t *val);

int32_t ism6hg256x_filt_xl_lp2_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_filt_xl_lp2_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

int32_t ism6hg256x_filt_xl_hp_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_filt_xl_hp_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

int32_t ism6hg256x_filt_xl_fast_settling_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_filt_xl_fast_settling_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM6HG256X_HP_MD_NORMAL    = 0x0,
  ISM6HG256X_HP_MD_REFERENCE = 0x1,
} ism6hg256x_filt_xl_hp_mode_t;
int32_t ism6hg256x_filt_xl_hp_mode_set(const ism6hg256x_ctx_t *ctx,
                                       ism6hg256x_filt_xl_hp_mode_t val);
int32_t ism6hg256x_filt_xl_hp_mode_get(const ism6hg256x_ctx_t *ctx,
                                       ism6hg256x_filt_xl_hp_mode_t *val);

typedef enum {
  ISM6HG256X_WK_FEED_SLOPE          = 0x0,
  ISM6HG256X_WK_FEED_HIGH_PASS      = 0x1,
  ISM6HG256X_WK_FEED_LP_WITH_OFFSET = 0x2,
} ism6hg256x_filt_wkup_act_feed_t;
int32_t ism6hg256x_filt_wkup_act_feed_set(const ism6hg256x_ctx_t *ctx,
                                          ism6hg256x_filt_wkup_act_feed_t val);
int32_t ism6hg256x_filt_wkup_act_feed_get(const ism6hg256x_ctx_t *ctx,
                                          ism6hg256x_filt_wkup_act_feed_t *val);

int32_t ism6hg256x_mask_trigger_xl_settl_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_mask_trigger_xl_settl_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM6HG256X_SIXD_FEED_ODR_DIV_2 = 0x0,
  ISM6HG256X_SIXD_FEED_LOW_PASS  = 0x1,
} ism6hg256x_filt_sixd_feed_t;
int32_t ism6hg256x_filt_sixd_feed_set(const ism6hg256x_ctx_t *ctx,
                                      ism6hg256x_filt_sixd_feed_t val);
int32_t ism6hg256x_filt_sixd_feed_get(const ism6hg256x_ctx_t *ctx,
                                      ism6hg256x_filt_sixd_feed_t *val);

typedef enum {
  ISM6HG256X_EIS_LP_NORMAL = 0x0,
  ISM6HG256X_EIS_LP_LIGHT  = 0x1,
} ism6hg256x_filt_gy_eis_lp_bandwidth_t;
int32_t ism6hg256x_filt_gy_eis_lp_bandwidth_set(const ism6hg256x_ctx_t *ctx,
                                                ism6hg256x_filt_gy_eis_lp_bandwidth_t val);
int32_t ism6hg256x_filt_gy_eis_lp_bandwidth_get(const ism6hg256x_ctx_t *ctx,
                                                ism6hg256x_filt_gy_eis_lp_bandwidth_t *val);

