stm32duino/ISM6HG256X/src/ism6hg256x_reg.h
int32_t ism6hg256x_xl_hg_peak_tracking_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_xl_hg_peak_tracking_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

int32_t ism6hg256x_xl_hg_sensitivity_set(const ism6hg256x_ctx_t *ctx, uint16_t val);
int32_t ism6hg256x_xl_hg_sensitivity_get(const ism6hg256x_ctx_t *ctx, uint16_t *val);

int32_t ism6hg256x_fsm_long_cnt_timeout_set(const ism6hg256x_ctx_t *ctx, uint16_t val);
int32_t ism6hg256x_fsm_long_cnt_timeout_get(const ism6hg256x_ctx_t *ctx, uint16_t *val);

int32_t ism6hg256x_fsm_number_of_programs_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_fsm_number_of_programs_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

int32_t ism6hg256x_fsm_start_address_set(const ism6hg256x_ctx_t *ctx, uint16_t val);
int32_t ism6hg256x_fsm_start_address_get(const ism6hg256x_ctx_t *ctx, uint16_t *val);

int32_t ism6hg256x_ff_time_windows_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_ff_time_windows_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM6HG256X_156_mg = 0x0,
  ISM6HG256X_219_mg = 0x1,
  ISM6HG256X_250_mg = 0x2,
  ISM6HG256X_312_mg = 0x3,
  ISM6HG256X_344_mg = 0x4,
  ISM6HG256X_406_mg = 0x5,
  ISM6HG256X_469_mg = 0x6,
  ISM6HG256X_500_mg = 0x7,
} ism6hg256x_ff_thresholds_t;
int32_t ism6hg256x_ff_thresholds_set(const ism6hg256x_ctx_t *ctx,
                                     ism6hg256x_ff_thresholds_t val);
int32_t ism6hg256x_ff_thresholds_get(const ism6hg256x_ctx_t *ctx,
                                     ism6hg256x_ff_thresholds_t *val);

typedef enum {
  ISM6HG256X_MLC_OFF                             = 0x0,
  ISM6HG256X_MLC_ON                              = 0x1,
  ISM6HG256X_MLC_ON_BEFORE_FSM                   = 0x2,
} ism6hg256x_mlc_mode_t;
int32_t ism6hg256x_mlc_set(const ism6hg256x_ctx_t *ctx, ism6hg256x_mlc_mode_t val);
int32_t ism6hg256x_mlc_get(const ism6hg256x_ctx_t *ctx, ism6hg256x_mlc_mode_t *val);

typedef enum {
  ISM6HG256X_MLC_15Hz  = 0x0,
  ISM6HG256X_MLC_30Hz  = 0x1,
  ISM6HG256X_MLC_60Hz  = 0x2,
  ISM6HG256X_MLC_120Hz = 0x3,
  ISM6HG256X_MLC_240Hz = 0x4,
  ISM6HG256X_MLC_480Hz = 0x5,
  ISM6HG256X_MLC_960Hz = 0x6,
} ism6hg256x_mlc_data_rate_t;
int32_t ism6hg256x_mlc_data_rate_set(const ism6hg256x_ctx_t *ctx,
                                     ism6hg256x_mlc_data_rate_t val);
int32_t ism6hg256x_mlc_data_rate_get(const ism6hg256x_ctx_t *ctx,
                                     ism6hg256x_mlc_data_rate_t *val);

typedef struct {
  uint8_t mlc1_src;
  uint8_t mlc2_src;
  uint8_t mlc3_src;
  uint8_t mlc4_src;
  uint8_t mlc5_src;
  uint8_t mlc6_src;
  uint8_t mlc7_src;
  uint8_t mlc8_src;
} ism6hg256x_mlc_out_t;
int32_t ism6hg256x_mlc_out_get(const ism6hg256x_ctx_t *ctx, ism6hg256x_mlc_out_t *val);

int32_t ism6hg256x_mlc_ext_sens_sensitivity_set(const ism6hg256x_ctx_t *ctx,
                                                uint16_t val);
int32_t ism6hg256x_mlc_ext_sens_sensitivity_get(const ism6hg256x_ctx_t *ctx,
                                                uint16_t *val);

typedef enum {
  ISM6HG256X_OIS_CTRL_FROM_OIS = 0x0,
  ISM6HG256X_OIS_CTRL_FROM_UI  = 0x1,
} ism6hg256x_ois_ctrl_mode_t;
int32_t ism6hg256x_ois_ctrl_mode_set(const ism6hg256x_ctx_t *ctx,
                                     ism6hg256x_ois_ctrl_mode_t val);
int32_t ism6hg256x_ois_ctrl_mode_get(const ism6hg256x_ctx_t *ctx,
                                     ism6hg256x_ois_ctrl_mode_t *val);

int32_t ism6hg256x_ois_reset_set(const ism6hg256x_ctx_t *ctx, int8_t val);
int32_t ism6hg256x_ois_reset_get(const ism6hg256x_ctx_t *ctx, int8_t *val);

int32_t ism6hg256x_ois_interface_pull_up_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_ois_interface_pull_up_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

typedef struct {
  uint8_t ack                          : 1;
  uint8_t req                          : 1;
} ism6hg256x_ois_handshake_t;
int32_t ism6hg256x_ois_handshake_from_ui_set(const ism6hg256x_ctx_t *ctx,
                                             ism6hg256x_ois_handshake_t val);
int32_t ism6hg256x_ois_handshake_from_ui_get(const ism6hg256x_ctx_t *ctx,
                                             ism6hg256x_ois_handshake_t *val);
int32_t ism6hg256x_ois_handshake_from_ois_set(const ism6hg256x_ctx_t *ctx,
                                              ism6hg256x_ois_handshake_t val);
int32_t ism6hg256x_ois_handshake_from_ois_get(const ism6hg256x_ctx_t *ctx,
                                              ism6hg256x_ois_handshake_t *val);

int32_t ism6hg256x_ois_shared_set(const ism6hg256x_ctx_t *ctx, uint8_t val[6]);
int32_t ism6hg256x_ois_shared_get(const ism6hg256x_ctx_t *ctx, uint8_t val[6]);

int32_t ism6hg256x_ois_on_if2_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_ois_on_if2_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

typedef struct {
  uint8_t gy                           : 1;
  uint8_t xl                           : 1;
} ism6hg256x_ois_chain_t;
int32_t ism6hg256x_ois_chain_set(const ism6hg256x_ctx_t *ctx, ism6hg256x_ois_chain_t val);
int32_t ism6hg256x_ois_chain_get(const ism6hg256x_ctx_t *ctx,
                                 ism6hg256x_ois_chain_t *val);

typedef enum {
  ISM6HG256X_OIS_250dps  = 0x1,
  ISM6HG256X_OIS_500dps  = 0x2,
  ISM6HG256X_OIS_1000dps = 0x3,
  ISM6HG256X_OIS_2000dps = 0x4,
} ism6hg256x_ois_gy_full_scale_t;
int32_t ism6hg256x_ois_gy_full_scale_set(const ism6hg256x_ctx_t *ctx,
                                         ism6hg256x_ois_gy_full_scale_t val);
int32_t ism6hg256x_ois_gy_full_scale_get(const ism6hg256x_ctx_t *ctx,
                                         ism6hg256x_ois_gy_full_scale_t *val);

typedef enum {
  ISM6HG256X_OIS_2g  = 0x0,
  ISM6HG256X_OIS_4g  = 0x1,
  ISM6HG256X_OIS_8g  = 0x2,
  ISM6HG256X_OIS_16g = 0x3,
} ism6hg256x_ois_xl_full_scale_t;
int32_t ism6hg256x_ois_xl_full_scale_set(const ism6hg256x_ctx_t *ctx,
                                         ism6hg256x_ois_xl_full_scale_t val);
int32_t ism6hg256x_ois_xl_full_scale_get(const ism6hg256x_ctx_t *ctx,
                                         ism6hg256x_ois_xl_full_scale_t *val);

