stm32duino/ISM6HG256X/src/ism6hg256x_reg.h
typedef struct {
  uint8_t step_counter_enable          : 1;
  uint8_t false_step_rej               : 1;
} ism6hg256x_stpcnt_mode_t;
int32_t ism6hg256x_stpcnt_mode_set(const ism6hg256x_ctx_t *ctx,
                                   ism6hg256x_stpcnt_mode_t val);
int32_t ism6hg256x_stpcnt_mode_get(const ism6hg256x_ctx_t *ctx,
                                   ism6hg256x_stpcnt_mode_t *val);

int32_t ism6hg256x_stpcnt_steps_get(const ism6hg256x_ctx_t *ctx, uint16_t *val);

int32_t ism6hg256x_stpcnt_rst_step_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_stpcnt_rst_step_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

int32_t ism6hg256x_stpcnt_debounce_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_stpcnt_debounce_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

int32_t ism6hg256x_stpcnt_period_set(const ism6hg256x_ctx_t *ctx, uint16_t val);
int32_t ism6hg256x_stpcnt_period_get(const ism6hg256x_ctx_t *ctx, uint16_t *val);

int32_t ism6hg256x_sflp_game_rotation_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_sflp_game_rotation_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

typedef struct {
  float_t gbias_x; /* dps */
  float_t gbias_y; /* dps */
  float_t gbias_z; /* dps */
} ism6hg256x_sflp_gbias_t;
int32_t ism6hg256x_sflp_game_gbias_set(const ism6hg256x_ctx_t *ctx,
                                       ism6hg256x_sflp_gbias_t *val);

typedef struct {
  float_t quat_w;
  float_t quat_x;
  float_t quat_y;
  float_t quat_z;
} ism6hg256x_quaternion_t;
int32_t ism6hg256x_sflp_quaternion_get(const ism6hg256x_ctx_t *ctx, ism6hg256x_quaternion_t *quat);

typedef enum {
  ISM6HG256X_SFLP_15Hz  = 0x0,
  ISM6HG256X_SFLP_30Hz  = 0x1,
  ISM6HG256X_SFLP_60Hz  = 0x2,
  ISM6HG256X_SFLP_120Hz = 0x3,
  ISM6HG256X_SFLP_240Hz = 0x4,
  ISM6HG256X_SFLP_480Hz = 0x5,
} ism6hg256x_sflp_data_rate_t;
int32_t ism6hg256x_sflp_data_rate_set(const ism6hg256x_ctx_t *ctx,
                                      ism6hg256x_sflp_data_rate_t val);
int32_t ism6hg256x_sflp_data_rate_get(const ism6hg256x_ctx_t *ctx,
                                      ism6hg256x_sflp_data_rate_t *val);

typedef struct {
  uint8_t tap_x_en                     : 1;
  uint8_t tap_y_en                     : 1;
  uint8_t tap_z_en                     : 1;
} ism6hg256x_tap_detection_t;
int32_t ism6hg256x_tap_detection_set(const ism6hg256x_ctx_t *ctx,
                                     ism6hg256x_tap_detection_t val);
int32_t ism6hg256x_tap_detection_get(const ism6hg256x_ctx_t *ctx,
                                     ism6hg256x_tap_detection_t *val);

typedef struct {
  uint8_t x                            : 5;
  uint8_t y                            : 5;
  uint8_t z                            : 5;
} ism6hg256x_tap_thresholds_t;
int32_t ism6hg256x_tap_thresholds_set(const ism6hg256x_ctx_t *ctx,
                                      ism6hg256x_tap_thresholds_t val);
int32_t ism6hg256x_tap_thresholds_get(const ism6hg256x_ctx_t *ctx,
                                      ism6hg256x_tap_thresholds_t *val);

typedef enum {
  ISM6HG256X_XYZ  = 0x0,
  ISM6HG256X_YXZ  = 0x1,
  ISM6HG256X_XZY  = 0x2,
  ISM6HG256X_ZYX  = 0x3,
  ISM6HG256X_YZX  = 0x5,
  ISM6HG256X_ZXY  = 0x6,
} ism6hg256x_tap_axis_priority_t;
int32_t ism6hg256x_tap_axis_priority_set(const ism6hg256x_ctx_t *ctx,
                                         ism6hg256x_tap_axis_priority_t val);
int32_t ism6hg256x_tap_axis_priority_get(const ism6hg256x_ctx_t *ctx,
                                         ism6hg256x_tap_axis_priority_t *val);

typedef struct {
  uint8_t shock                        : 2;
  uint8_t quiet                        : 2;
  uint8_t tap_gap                      : 4;
} ism6hg256x_tap_time_windows_t;
int32_t ism6hg256x_tap_time_windows_set(const ism6hg256x_ctx_t *ctx,
                                        ism6hg256x_tap_time_windows_t val);
int32_t ism6hg256x_tap_time_windows_get(const ism6hg256x_ctx_t *ctx,
                                        ism6hg256x_tap_time_windows_t *val);

typedef enum {
  ISM6HG256X_ONLY_SINGLE        = 0x0,
  ISM6HG256X_BOTH_SINGLE_DOUBLE = 0x1,
} ism6hg256x_tap_mode_t;
int32_t ism6hg256x_tap_mode_set(const ism6hg256x_ctx_t *ctx, ism6hg256x_tap_mode_t val);
int32_t ism6hg256x_tap_mode_get(const ism6hg256x_ctx_t *ctx, ism6hg256x_tap_mode_t *val);

int32_t ism6hg256x_tilt_mode_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_tilt_mode_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

int32_t ism6hg256x_timestamp_raw_get(const ism6hg256x_ctx_t *ctx, uint32_t *val);

int32_t ism6hg256x_timestamp_set(const ism6hg256x_ctx_t *ctx, uint8_t val);
int32_t ism6hg256x_timestamp_get(const ism6hg256x_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM6HG256X_XL_AND_GY_NOT_AFFECTED       = 0x0,
  ISM6HG256X_XL_LOW_POWER_GY_NOT_AFFECTED = 0x1,
  ISM6HG256X_XL_LOW_POWER_GY_SLEEP        = 0x2,
  ISM6HG256X_XL_LOW_POWER_GY_POWER_DOWN   = 0x3,
} ism6hg256x_act_mode_t;
int32_t ism6hg256x_act_mode_set(const ism6hg256x_ctx_t *ctx, ism6hg256x_act_mode_t val);
int32_t ism6hg256x_act_mode_get(const ism6hg256x_ctx_t *ctx, ism6hg256x_act_mode_t *val);

typedef enum {
  ISM6HG256X_SLEEP_TO_ACT_AT_1ST_SAMPLE = 0x0,
  ISM6HG256X_SLEEP_TO_ACT_AT_2ND_SAMPLE = 0x1,
  ISM6HG256X_SLEEP_TO_ACT_AT_3RD_SAMPLE = 0x2,
  ISM6HG256X_SLEEP_TO_ACT_AT_4th_SAMPLE = 0x3,
} ism6hg256x_act_from_sleep_to_act_dur_t;
int32_t ism6hg256x_act_from_sleep_to_act_dur_set(const ism6hg256x_ctx_t *ctx,
                                                 ism6hg256x_act_from_sleep_to_act_dur_t val);
int32_t ism6hg256x_act_from_sleep_to_act_dur_get(const ism6hg256x_ctx_t *ctx,
                                                 ism6hg256x_act_from_sleep_to_act_dur_t *val);

typedef enum {
  ISM6HG256X_1Hz875 = 0x0,
  ISM6HG256X_15Hz   = 0x1,
  ISM6HG256X_30Hz   = 0x2,
  ISM6HG256X_60Hz   = 0x3,
} ism6hg256x_act_sleep_xl_odr_t;
int32_t ism6hg256x_act_sleep_xl_odr_set(const ism6hg256x_ctx_t *ctx,
                                        ism6hg256x_act_sleep_xl_odr_t val);
int32_t ism6hg256x_act_sleep_xl_odr_get(const ism6hg256x_ctx_t *ctx,
                                        ism6hg256x_act_sleep_xl_odr_t *val);

typedef struct {
  ism6hg256x_inactivity_dur_t inactivity_cfg;
  uint8_t inactivity_ths;
  uint8_t threshold;
  uint8_t duration;
} ism6hg256x_act_thresholds_t;
int32_t ism6hg256x_act_thresholds_set(const ism6hg256x_ctx_t *ctx,
                                      ism6hg256x_act_thresholds_t *val);
int32_t ism6hg256x_act_thresholds_get(const ism6hg256x_ctx_t *ctx,
                                      ism6hg256x_act_thresholds_t *val);

typedef struct {
  uint8_t shock                        : 2;
  uint8_t quiet                        : 4;
} ism6hg256x_act_wkup_time_windows_t;
int32_t ism6hg256x_act_wkup_time_windows_set(const ism6hg256x_ctx_t *ctx,
                                             ism6hg256x_act_wkup_time_windows_t val);
int32_t ism6hg256x_act_wkup_time_windows_get(const ism6hg256x_ctx_t *ctx,
                                             ism6hg256x_act_wkup_time_windows_t *val);

/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /*ISM6HG256X_DRIVER_H */
